app/controllers/messages_controller.rb

SELECT "messages".* FROM "messages" ORDER BY RANDOM() LIMIT $1  [["LIMIT", 1]]
---
  def random_greeting
    message = Message.order('RANDOM()').first